In [2]:
# 05: Membalik urutan baris dan kolom pada Data Frame
# Import Modules

In [3]:
import pandas as pd
import numpy as np

print(pd.__version__)
print(np.__version__)

2.3.3
2.3.4

# Persiapan Data Frame

In [4]:
n_rows = 5
n_cols = 5
cols = tuple('ABCDE')

df = pd.DataFrame(np.random.randint(1, 10, size=(n_rows, n_cols)), 
                  columns=cols)
df

   A  B  C  D  E
0  7  6  4  4  5
1  5  4  7  8  3
2  3  1  3  4  7
3  6  5  5  1  2
4  8  1  8  3  2

# Membalik urutan kolom

In [5]:
df.loc[:, ::-1]

   E  D  C  B  A
0  5  4  4  6  7
1  3  8  7  4  5
2  7  4  3  1  3
3  2  1  5  5  6
4  2  3  8  1  8

# Membalik urutan baris

In [6]:
df.loc[::-1]

   A  B  C  D  E
4  8  1  8  3  2
3  6  5  5  1  2
2  3  1  3  4  7
1  5  4  7  8  3
0  7  6  4  4  5

# Membalik urutan baris dan melakukan penyesuaian ulang index

In [7]:
df.loc[::-1].reset_index(drop=True)

   A  B  C  D  E
0  8  1  8  3  2
1  6  5  5  1  2
2  3  1  3  4  7
3  5  4  7  8  3
4  7  6  4  4  5

# 06: Mengganti nama (label) kolom pada Data Frame
# Import Modules

In [8]:
import pandas as pd
import numpy as np

print(pd.__version__)
print(np.__version__)

2.3.3
2.3.4

# Persiapan Data Frame

In [9]:
n_rows = 5
n_cols = 5
cols = tuple('ABCDE')

df = pd.DataFrame(np.random.randint(1, 10, size=(n_rows, n_cols)), 
                  columns=cols)
df

   A  B  C  D  E
0  8  9  3  4  6
1  7  8  7  1  1
2  2  4  3  1  7
3  5  2  5  5  6
4  5  1  8  4  9

# Mengganti nama (label) untuk sebuah kolom pada Data Frame

In [10]:
df.rename(columns={'C':'Hobi'})

   A  B  Hobi  D  E
0  8  9     3  4  6
1  7  8     7  1  1
2  2  4     3  1  7
3  5  2     5  5  6
4  5  1     8  4  9

# Mengganti nama (label) untuk banyak kolom pada Data Frame

In [11]:
df.rename(columns={'A':'Nama', 'B':'Alamat', 'D':'Kota'})

   Nama  Alamat  C  Kota  E
0     8       9  3     4  6
1     7       8  7     1  1
2     2       4  3     1  7
3     5       2  5     5  6
4     5       1  8     4  9

# 07: Menghapus (drop) missing values (NaN)
# Import Modules

In [12]:
import pandas as pd

print(pd.__version__)

2.3.3

# Persiapan Data Frame

In [13]:
## DEPRICATED ##
# df = pd.util.testing.makeMissingDataframe().reset_index() 
# df.head()

In [14]:
n_rows = 30
n_cols = 4
cols = ['A', 'B', 'C', 'D']

df = pd.DataFrame(np.random.randn(n_rows, n_cols), columns=cols)

nan_mask = np.random.rand(n_rows, n_cols) < 0.2
df[nan_mask] = np.nan

df = df.reset_index()
df.head()

   index         A         B         C         D
0      0       NaN -0.622392  0.183655 -0.716333
1      1 -1.566173  0.318848 -0.917344 -0.573660
2      2 -0.208311  1.606572  0.953134 -0.507317
3      3 -0.830554  0.474049  0.584353 -0.138636
4      4       NaN       NaN -0.637776 -0.751600

In [15]:
df = df.rename(columns={'index':'Z'})
df.head()

   Z         A         B         C         D
0  0       NaN -0.622392  0.183655 -0.716333
1  1 -1.566173  0.318848 -0.917344 -0.573660
2  2 -0.208311  1.606572  0.953134 -0.507317
3  3 -0.830554  0.474049  0.584353 -0.138636
4  4       NaN       NaN -0.637776 -0.751600

In [16]:
df_backup = df.copy(deep=True)

# Menghapus (drop) setiap kolom yang mengandung missing values

In [17]:
df = df.dropna(axis='columns') 
df.head()

   Z
0  0
1  1
2  2
3  3
4  4

# Menghapus (drop) setiap baris yang mengandung missing values

In [18]:
df = df_backup.copy(deep=True)
df = df.dropna(axis='rows')
df.head()

   Z         A         B         C         D
1  1 -1.566173  0.318848 -0.917344 -0.573660
2  2 -0.208311  1.606572  0.953134 -0.507317
3  3 -0.830554  0.474049  0.584353 -0.138636
5  5 -0.861232 -0.589522  1.556392  0.534893
8  8  2.347517 -0.044947 -1.664991  0.792707

# Persentase missing values untuk tiap kolom

In [19]:
df = df_backup.copy(deep=True)
df.isna().mean()

Z    0.000000
A    0.266667
B    0.266667
C    0.200000
D    0.066667
dtype: float64

# Menghapus (drop) setiap kolom yang mengandung missing values berdasarkan threshold

In [20]:
treshold = len(df) * 0.9
df = df.dropna(thresh=treshold, axis='columns')
df.head()

   Z         D
0  0 -0.716333
1  1 -0.573660
2  2 -0.507317
3  3 -0.138636
4  4 -0.751600

# 08: Memeriksa kesamaan antar dua buah kolom (Series) pada Data Frame
# Import Modules

In [21]:
import pandas as pd
import numpy as np

print(pd.__version__)
print(np.__version__)

2.3.3
2.3.4

# Persiapan Data Frame

In [22]:
data = {'A':[15, 15, 18, np.nan, 12], 
        'B':[15, 15, 18, np.nan, 12]}

df = pd.DataFrame(data)
df

      A     B
0  15.0  15.0
1  15.0  15.0
2  18.0  18.0
3   NaN   NaN
4  12.0  12.0

# Mengenal Pandas Series

In [23]:
df['A']

0    15.0
1    15.0
2    18.0
3     NaN
4    12.0
Name: A, dtype: float64

In [24]:
type(df['A'])

pandas.core.series.Series

In [25]:
type(df)

pandas.core.frame.DataFrame

# Memeriksa kesamaan dengan operator ==

In [26]:
df['A'] == df['B']

0     True
1     True
2     True
3    False
4     True
dtype: bool

# Memeriksa kesamaan dengan method equals()

In [27]:
df['A'].equals(df['B'])

True

# Memeriksa kesamaan antar dua Data Frame

In [28]:
df1 = df.copy(deep=True)

df.equals(df1)

True

In [29]:
df == df1

       A      B
0   True   True
1   True   True
2   True   True
3  False  False
4   True   True